---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NoRisersInPureMonolithicStairs
source: html/b3fe1ed7-9507-6427-494d-2f84106dbf76.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.NoRisersInPureMonolithicStairs Property

Monolithic Stairs with zero tread thickness can't have risers

## Syntax (C#)
```csharp
public static FailureDefinitionId NoRisersInPureMonolithicStairs { get; }
```